## Doing some pandas exersices

In [4]:
import numpy as np
import pandas as pd
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [10]:
series = pd.Series(mylist)
series2 = pd.Series(myarr)
ser3 = pd.Series(mydict)

In [14]:
df = ser3.to_frame().reset_index()
print(df.head())

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

In [25]:
#4

ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

df = pd.DataFrame({'col1':ser1,'col2':ser2})
df = pd.concat([ser1,ser2],axis=1)

In [26]:
df.head()

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

In [27]:
#5
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

In [28]:
ser.name = 'alphabetical'
ser.head()

0    a
1    b
2    c
3    e
4    d
Name: alphabetical, dtype: object

In [29]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [30]:
ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

In [31]:
ser_u = pd.Series(np.union1d(ser1,ser2))
ser_i = pd.Series(np.intersect1d(ser1,ser2))
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

In [32]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [33]:
df = pd.DataFrame(exam_data,index = labels)

In [34]:
df.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

In [59]:
df.iloc[[1,3,4],[0,2]]

    name  attempts
b   Dima         3
d  James         3
e  Emily         2

In [62]:
df[df['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [64]:
total_cols = len(df.axes[1])

In [65]:
total_cols

4

In [68]:
df[df["score"].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [71]:
df[(df["score"] <= 20) & (df["score"]>15)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [73]:
df[(df["attempts"] <2) & (df["score"] >15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [75]:
df.loc['d','score'] = 11.5

In [76]:
df.attempts.sum()

19

In [77]:
df.loc['k'] = ['mitaka',2,3,'no']

In [81]:
df.drop('k')

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes